Revit 2027 API
SlabShapeCreaseArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual SlabShapeCreaseArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As SlabShapeCreaseArrayIterator
public:
virtual SlabShapeCreaseArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> SlabShapeCreaseArrayIterator
override ForwardIterator : unit -> SlabShapeCreaseArrayIterator
Return Value
SlabShapeCreaseArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
SlabShapeCreaseArray Class
Autodesk.Revit.DB Namespace